#include "common.h"

void showMainMenu()
{
    system("cls"); 

    cout << "-------------------------------------------" << endl;
    cout << "|===============歡迎使用記帳===============|" << endl;
    cout << "|                                         |" << endl;
    cout << "|*******          1.記帳          ********|" << endl;
    cout << "|*******          2.查詢          ********|" << endl;
    cout << "|*******          3.退出          ********|" << endl;
    cout << "|_________________________________________|" << endl;

    cout << "\n請選擇(1-3):";
}

void showAccountingMenu()
{
    cout << "-------------------------------------------" << endl;
    cout << "|===============選擇記帳種類===============|" << endl;
    cout << "|                                         |" << endl;
    cout << "|*******        1.收 入           ********|" << endl;
    cout << "|*******        2.支 出           ********|" << endl;
    cout << "|*******        3.返回主菜單       ********|" << endl;
    cout << "|_________________________________________|" << endl;

    cout << "\n請選擇(1-3):";
}

void showQueryMenu()
{
    cout << "-------------------------------------------" << endl;
    cout << "|===============選擇查詢條件===============|" << endl;
    cout << "|                                         |" << endl;
    cout << "|*******        1.統計所有帳目     ********|" << endl;
    cout << "|*******        2.統計收入         ********|" << endl;
    cout << "|*******        3.統寄支出         ********|" << endl;
    cout << "|*******        4.返回主菜單       ********|" << endl;
    cout << "|_________________________________________|" << endl;

    cout << "\n請選擇(1-4):";
}